[
    {
        "id": "helixJump",
        "title": "Helix Jump",
        "image": "https://placehold.co/600x400/ff6f61/FFFFFF?text=Helix+Jump",
        "description": "משחק קפיצות ממכר בו אתה מנווט כדור מבעד לפלטפורמות.",
        "type": "p5",
        "jsFile": "games/helix-jump.js",
        "story": "בעולם צבעוני ומתפתל, כדור קטן נזרק למטה, נחוש להגיע לקרקעית. המגדל מלא בפלטפורמות מסתובבות, וחלקן קטלניות. האם תצליח לכוון את הכדור בבטחה אל היציאה?",
        "instructions": [
            "החלק את האצבע או השתמש בעכבר כדי לסובב את המגדל.",
            "מצא את הפתחים בפלטפורמות כדי שהכדור יפול דרכן.",
            "הימנע מפלטפורמות אדומות - הן יסיימו את המשחק!",
            "נסה לבצע קומבואים על ידי מעבר דרך מספר פתחים ברצף."
        ],
        "gameType": "ארקייד"
    },
    {
        "id": "astroFruits",
        "title": "מסע הפירות",
        "image": "https://placehold.co/400x300/FF5733/FFFFFF?text=Fruit+Quest",
        "description": "צאו למסע פיקסלים מרתק במבוך הפירות! אספו את כל הפירות, התחמקו ממכשולים ופתחו יכולות חדשות בדרך לחופש. האם תצליחו לברוח מהמבוך?",
        "type": "p5",
        "jsFile": "games/astro-fruits.js",
        "story": "בעתיד הרחוק, כשהאנושות התפשטה בין הכוכבים, אתם, אסטרונאוט אמיץ בשם קפטן פרי, יצאתם למשימת חקר שגרתית בגלקסיה הלא נודעת. הכל הלך כשורה עד שסופת קוסמית בלתי צפויה פגעה בחללית שלכם, וגרמה לה להתרסק על פלנטה מוזרה... פלנטה המכוסה כולה בפירות ענקיים ומבוכים מסתוריים. גורלכם תלוי בכך!",
  "instructions": [
    "מטרת המשחק:",
    "אסוף את כל הפירות הירוקים בכל שלב כדי לעבור לשלב הבא.",
    "הימנע מהתנגשות באויבים אדומים ומנפילה מחוץ למסך.",
    "---",
    "שליטה:",
    "מקשי חיצים ימינה/שמאלה: כדי לנוע לרוחב המסך.",
    "מקש חץ למעלה: כדי לקפוץ. יש לך אפשרות לקפוץ קפיצה כפולה לפני שתגע בפלטפורמה הבאה!",
    "מקש רווח: כדי להתחיל משחק, להתחיל מחדש או לעבור לשלב הבא.",
    "מקש S: כדי להיכנס לחנות ממסך ההתחלה או ממסך הסיום.",
    "---",
    "חפצים, אויבים ומסכים:",
    "פירות ירוקים: המטרה העיקרית שלך. אסוף אותם כדי להשלים את השלב. כל פרי מוסיף לך נקודות.",
    "מטבעות זהב: פריטים לאיסוף שמוסיפים לך מטבעות כדי לקנות שדרוגים בחנות.",
    "אויבים אדומים: יצורים נעים שיסיימו את המשחק אם תיגע בהם.",
    "פלטפורמות אפורות: בסיסי הקפיצה שלך.",
    "טיימר: יש לך זמן מוגבל כדי לסיים כל שלב. שימו לב לטיימר בפינה הימנית העליונה!",
    "מסך חנות: במסך זה תוכל לבזבז את המטבעות שצברת כדי לרכוש סקינים חדשים לשחקן או לשדרג את יכולותיו (כוח קפיצה ומהירות תנועה).",
    "---",
    "החנות והשדרוגים:",
    "בחנות תוכלו לרכוש שדרוגים כדי להקל על המסע שלכם.",
    "סקינים:",
    "  - כוכב כחול: לחץ על מקש B כדי לרכוש (בעלות של 50 מטבעות).",
    "  - ריר ירוק: לחץ על מקש G כדי לרכוש (בעלות של 100 מטבעות).",
    "שדרוגים:",
    "  - כוח קפיצה: לחץ על מקש J כדי לשדרג. כל שדרוג יגביר את גובה הקפיצה שלך.",
    "  - מהירות: לחץ על מקש D כדי לשדרג. כל שדרוג יגביר את מהירות התנועה שלך."
  ]
        "gameType": "פלטפורמה"
    },
    {
        "id": "deepDive",
        "title": "Deep Dive",
        "image": "https://placehold.co/600x400/007bff/FFFFFF?text=Deep+Dive",
        "description": "משחק הישרדות במעמקים שבו אתה מנווט דג ומתחמק ממכשולים.",
        "type": "p5",
        "jsFile": "games/deep-dive.js",
        "story": "אתה דג קטן וזריז שנקלע בטעות למעמקי האוקיינוס, אזור מסוכן מלא ביצורים ימיים גדולים ומכשולים קטלניים. המשימה שלך היא לשרוד כמה שיותר זמן, לאסוף מטבעות ולהתחמק מכל סכנה אורבת.",
        "instructions": [
            "השתמשו במקשי החיצים (או WASD) כדי לשלוט בתנועת הדג.",
            "אספו מטבעות כדי לצבור נקודות.",
            "התחמקו מדגים גדולים יותר ומכשולים ימיים אחרים.",
            "שמרו על קצב מהיר כדי לא להיתפס על ידי הזרם."
        ],
        "gameType": "הישרדות"
    },
    {
        "id": "myGame",
        "title": "המשחק שלי",
        "image": "https://placehold.co/600x400/ff6f61/FFFFFF?text=My+Game",
        "description": "בואו ונראה אם זה עובד.",
        "type": "p5",
        "jsFile": "games/my-game.js",
        "story": "זהו משחק ניסיוני שנוצר כדי לבדוק את הפונקציונליות של המערכת. אין לו סיפור עמוק, אבל הוא מהווה נקודת התחלה מצוינת ליצירת משחקים עתידיים!",
        "instructions": [
            "אין הוראות ספציפיות למשחק זה, הוא מיועד לבדיקה."
        ],
        "gameType": "ניסיוני"
    },
    {
        "id": "snake",
        "title": "Snake Classic",
        "image": "https://placehold.co/600x400/4caf50/FFFFFF?text=Snake",
        "description": "הגרסה המחודשת של משחק הנחש הקלאסי.",
        "type": "p5",
        "jsFile": "games/snake-classic.js",
        "story": "חזור לשנות ה-90 עם הגרסה הקלאסית של משחק הנחש האהוב. נחש רעב משוטט על המסך, גדל עם כל תפוח שהוא בולע. אבל היזהר, כל טעות עלולה להיות האחרונה!",
        "instructions": [
            "השתמשו במקשי החיצים כדי לשלוט בכיוון הנחש.",
            "אספו את התפוחים המופיעים על המסך כדי שהנחש יגדל.",
            "הימנעו מלהתנגש בקירות או בזנב של הנחש עצמו.",
            "המטרה היא לצבור כמה שיותר נקודות."
        ],
        "gameType": "קלאסי"
    },
    {
        "id": "flappyBird",
        "title": "Flappy Bird",
        "image": "https://placehold.co/600x400/2196f3/FFFFFF?text=Flappy+Bird",
        "description": "העוף הקטן צריך לעבור בין צינורות מבלי להתרסק!",
        "type": "p5",
        "jsFile": "games/flappy-bird.js",
        "story": "ציפור קטנה וחמודה, אך חסרת מזל, מוצאת את עצמה בעולם מלא בצינורות ירוקים. המשימה שלה פשוטה: לשרוד כמה שיותר זמן על ידי מעבר בין הצינורות, אבל זה הרבה יותר קשה ממה שזה נשמע!",
        "instructions": [
            "לחצו על מקש הרווח (או געו במסך) כדי שהציפור תקפוץ.",
            "תזמנו את הקפיצות שלכם כדי לעבור דרך הפערים בין הצינורות.",
            "כל מעבר מוצלח דרך צינור מעניק נקודה.",
            "הימנעו מלהתנגש בצינורות או בקרקע."
        ],
        "gameType": "ארקייד"
    }
]
